[
    "B1. How could I devise an experiment to help solve that problem?",
    "B2. Make a list of ideas for solving this problem, and apply them one by one to the problem to see if any progress can be made",
    "B3. How could I measure progress on this problem?",
    "B4. How can I simplify the problem so that it is easier to solve?",
    "B5. What are the key assumptions underlying this problem?",
    "B7. What are the alternative perspectives or viewpoints on this problem?",
    "B8. What are the long-term implications of this problem and its solutions?",
    "B10. Critical Thinking: This style involves analyzing the problem from different perspectives, questioning assumptions, and evaluating the evidence or information available. It focuses on logical reasoning, evidence-based decision-making, and identifying potential biases or flaws in thinking.",
    "B13. Use systems thinking: Consider the problem as part of a larger system and understanding the interconnectedness of various elements. Focuses on identifying the underlying causes, feedback loops, and interdependencies that influence the problem, and developing holistic solutions that address the system as a whole.",
    "B15. Use Reflective Thinking: Step back from the problem, take the time for introspection and self-reflection. Examine personal biases, assumptions, and mental models that may influence problem-solving, and being open to learning from past experiences to improve future approaches.",
    "B16. What is the core issue or problem that needs to be addressed?",
    "B17. What are the underlying causes or factors contributing to the problem?",
    "B18. Are there any potential solutions or strategies that have been tried before? If yes, what were the outcomes and lessons learned?",
    "B19. What are the potential obstacles or challenges that might arise in solving this problem?",
    "B20. Are there any relevant data or information that can provide insights into the problem? If yes, what data sources are available, and how can they be analyzed?",
    "B21. Are there any stakeholders or individuals who are directly affected by the problem? What are their perspectives and needs?",
    "B23. How can progress or success in solving the problem be measured or evaluated?",
    "B24. What indicators or metrics can be used?",
    "B25. Is the problem a technical or practical one that requires a specific expertise or skill set? Or is it more of a conceptual or theoretical problem?",
    "B27. Is the problem related to human behavior, such as a social, cultural, or psychological issue?",
    "B28. Does the problem involve decision-making or planning, where choices need to be made under uncertainty or with competing objectives?",
    "B29. Is the problem an analytical one that requires data analysis, modeling, or optimization techniques?",
    "B32. Is the problem time-sensitive or urgent, requiring immediate attention and action?",
    "B33. What kinds of solution typically are produced for this kind of problem specification?",
    "B34. Given the problem specification and the current best solution, have a guess about other possible solutions.",
    "B35. Let's imagine the current best solution is totally wrong, what other ways are there to think about the problem specification?",
    "B36. What is the best way to modify this current best solution, given what you know about these kinds of problem specification?",
    "B37. Ignoring the current best solution, create an entirely new solution to the problem.",
    "B38. Let’s think step by step.",
    "B39. Let’s make a step by step plan and implement it with good notion and explanation"
]
